app/Controllers/Pages.php

    public function artikeldaftar()
    {
        $data = [
            'title' => 'Daftar Artikel | Baskara',
            'artikel' => $this->db->table('artikel')->orderBy('tanggal', 'desc')->orderBy('idartikel', 'desc')->get()->getResult()
---
SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC, `idartikel` DESC

    public function artikeldetail($idartikel)
    {
        $data = [
            'title' => 'Detail Artikel | Baskara',
            'validation' => \Config\Services::validation(),
            'row' => $this->db->table('artikel')->where('idartikel', $idartikel)->get()->getRow(),
---
SELECT *
FROM `artikel`
WHERE `idartikel` = '2'