app/Models/BaskaraModel.php

SELECT *
FROM `kamus`
WHERE `huruf` = 'A'
ORDER BY `bahasa_indo` ASC
---
    public function getByHuruf($huruf)
{
    $builder = $this->db->table('kamus');
    $builder->where('huruf', $huruf);
    $builder->orderBy('bahasa_indo', 'ASC');
    return $builder->get()->getResultArray();